# ScheduleSheetAppearanceParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ScheduleSheetAppearanceParam Property
ParameterTypeId Class See Also
---
"Appearance"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ScheduleSheetAppearanceParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ScheduleSheetAppearanceParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ScheduleSheetAppearanceParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace